sdaiGetAggrByIterator(Sdai_ItrId*,SdaiPrimitiveType,System.Void*)
\details
Retrieves the value of the current element referenced by a specified iterator.
\param iterator [in] An iterator to get the value from.
\param valueType [in] A type of the element value .
\param value [out] A placeholder for the required element value.
\returns A raw pointer to the element value.